despues_instalar_emacs/despues_instalar_emacs-2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2016-07-19 mar 17:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Qué hacer después de instalar Emacs (2ª Parte)</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Maxxcan" />
</head>
<body>
<div id="content">
<h1 class="title">Qué hacer después de instalar Emacs (2ª Parte)</h1>


<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">1</span> Algunos paquetes interesantes</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Ido mode</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>Ido Mode</b> extiende comandos como <i>find-file</i> y <i>switch-to-buffer</i> que como os podeís imaginar sirve para
<b>abrir un fichero</b> o <b>cambiar de buffer</b>. Lo que hacer es que cuando ejecutamos cualquiera de esos comandos con
por ejemplo <b>Ctrl+x+Ctrl+f</b> o <b>Ctrl+x+b</b> nos aparece de forma visual las opciones que tenemos.
En este <a href="https://asciinema.org/a/27740">enlace</a> podemos ver en un vídeo cómo actúa.  
</p>

<p>
Además de lo dicho se puede extender con <b>otras extensiones</b> que le dan <b>nuevas caractéristicas</b> y además
se puede usar en otros lugares además de los dichos.
</p>

<p>
No hace falta instalarlo ya que <b>viene por defecto</b>, sólo hay que <b>activarlo</b> escribiremos lo siguiente en nuestro fichero de configuración:
</p>

<div class="org-src-container">

<pre class="src src-elisp">(require 'ido)
(ido-mode)
(ido-everywhere)
</pre>
</div>

<p>
Para más información os recomiendo <a href="http://defn.io/posts/2015-10-12-ido-mode.html">este artículo</a>  
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Undo tree</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<b>Undo tree</b> o árbol de deshacer, es para mí la <b>forma más bonita y práctica</b> de poder <b>hacer y deshacer</b> en <i>Emacs</i>. 
Es bonito y es práctico. Como os imagináis nos muestra un <b>árbol</b> donde podemos ver con ramas y todo nuestro <b>historial 
de acciones</b> y podemos movernos en el tiempo hacia delante y hacia atrás para <b>hacerlas o deshacerlas</b> y además nos 
permite <b>cambiar de rama</b>. 
</p>

<p>
Yo creo que con esta imágen que ya muy claro. 
</p>

<p>
% imagen %
</p>

<p>
Para <b>instalarlo</b> vamos a nuestro <b>gestor de paquetes</b> y buscamos el paquete <b>undo-tree</b>. 
</p>

<p>
Una vez instalado, para <b>activarlo</b>, agregamos a nuestro fichero de configuración lo siguiente:
</p>

<div class="org-src-container">

<pre class="src src-elisp">(global-undo-tree-mode)
</pre>
</div>


<p>
Para más información en inglés tenéis este <a href="https://www.emacswiki.org/emacs/UndoTree">enlace</a>
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> Wich key</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<b>Which key</b> nos permite <b>mostrarnos</b> cuales son las <b>combinaciones de teclas</b> de cada acción o comando en <i>Emacs</i>. Es realmente
práctico ya que nos ayuda a realizar los comandos con las combinaciones de teclas y además a recordarlas.
</p>

<p>
Para <b>instalarlo</b>, en el <b>gestor de paquetes</b> buscaremos el paquete llamado <b>which-key</b>.  
</p>

<p>
Una vez instalado lo <b>activamos</b> escribiendo en el fichero de configuración: 
</p>

<div class="org-src-container">

<pre class="src src-elisp">(require 'which-key)
(which-key-mode)

(setq which-key-popup-type 'minibuffer)
</pre>
</div>

<p>
Todo lo referente a este paquete lo podemos encontrar en este <a href="https://github.com/justbur/emacs-which-key">enlace</a> aunque ya le dedicaremos un o dos artículos al igual
que el resto de paquetes que estamos comentado. 
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> Flycheck</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<b>Flycheck</b> es un paquete o complemento que te <b>chequea el estilo y la sintaxis</b> de muchos lenguajes de programación. No están
todos pero hay muchísimos, de hecho hay <a href="http://www.flycheck.org/en/latest/languages.html">más de 40</a> lenguajes. 
</p>

<p>
Para <b>instalar</b> este paquete podemos usar nuestro <b>gestor de paquetes</b> habitual, buscar el paquete <b>flycheck</b> y añadir al fichero de configuración: 
</p>

<div class="org-src-container">

<pre class="src src-elisp">(add-hook 'after-init-hook #'global-flycheck-mode)
</pre>
</div>

<p>
Una vez instalado podemos instalar <b>dos programas</b> que son para el chequeo sintáctico de <b>python y javascript</b>: 
</p>

<p>
Para ello: 
</p>

<div class="org-src-container">

<pre class="src src-shell">pip install pylint
npm install eslint
</pre>
</div>

<p>
Posterior a eso he hecho la prueba con un archivo que imprime "hola" en python y con esto me he encontrado:
</p>

<p>
%imagen%
</p>

<p>
Aquí vemos en la imagen que la línea está precedida por una señal roja y abajo nos indica de que tenemos que poner paréntesis.
</p>

<p>
Si lo hacemos:
</p>


<p>
%imagen%
</p>

<p>
Pues la marca roja cambia a verde aunque aún así me sigue dando algunos consejos. 
</p>

<p>
Sin necesidad de instalar nada también me da consejos para mi fichero de configuración de Emacs. 
</p>

<p>
%imagen% 
</p>

<p>
Podréis encontrar más información en este <a href="http://www.flycheck.org/en/latest/languages.html#flycheck-languages">enlace.</a>
</p>

<p>
Además de <b>flycheck</b> en Emacs también hay otro paquete llamado <b>flymaker</b> que también corrige nuestra sintaxis. El tema de estos
programas es algo complejo por lo que lo dejaremos para un <b>artículo completo</b> donde comentaremos más sobre estos programas
y la diferencia entre ambos.  
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.5</span> Auto-complete</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Sí, <b>auto-complete</b> hace lo que promete y es <b>autocompletar</b> el texto que estamos escribiendo. Sirve tanto para cuando estás escribiendo
un programa con un lenguaje de programación o un documento cualesquiera. 
</p>

<p>
Para <b>instalarlo</b> lo hacemos con nuestro <b>gestor de paquetes</b> y buscamos el paquete <b>auto-complete</b>. Además de este podemos instalar algunos que 
comienzan con <b>ac-</b> y van seguidos de un lenguaje de programación u otra cosa y agrega más autocompletado al programa. Existe alguna excepción
como el paquete <b>org-ac</b> y alguno otro más.  
</p>

<p>
Una vez instalado lo <b>activamos</b> escribiendo en el fichero de configuración:
</p>

<div class="org-src-container">

<pre class="src src-elisp">(require 'auto-complete-config)
(add-to-list 'ac-dictionary-directories "~/.emacs.d/ac-dict")
(ac-config-default)
</pre>
</div>

<p>
A partir de aquí observaremos esto: 
</p>

<p>
%imagen%
</p>


<p>
Este paquete y otro parecido son muy interesantes por lo que los veremos en <b>profundidad en un artículo exclusivo</b>
para ellos.
</p>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">1.6</span> Yasnippets</h3>
<div class="outline-text-3" id="text-1-6">
<p>
<b>Yasnippets</b> viene del acrónimo *"Yet Another Snippet Extension"* y lo que nos facilita es un montón de
<b>Snippets o trozos de código</b>. A estos trozos de código podemos acceder bien escribiendo un conjunto
de texto, una palabra o frase y expandiendola con una tecla, por defecto TAB, o bien accediendo
al menú. Por supuesto es más rápido con la tecla. 
</p>

<p>
Para <b>instalarlo</b> buscar el paquete llamado <b>Yasnippet</b> e instalarlo con el <b>gestor de paquetes</b> de Emacs 
y agregamos a nuestro <b>fichero de configuración</b> lo siguiente:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'yasnippet)
(yas-global-mode 1)
</pre>
</div>

<p>
Y ya veremos que en el menú de arriba ya aparece el menú de <b>Yasnippet</b> y podremos ver los código que nos ofrece. 
</p>

<p>
Este paquete también es muy interesante y ya le daremos un artículo profundizando más en él en un futuro.
</p>

<p>
De momento si quieres tener más información puedes visitar este <a href="http://joaotavora.github.io/yasnippet/">enlace</a>
</p>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">1.7</span> Algunos añadidos para lenguajes</h3>
<div class="outline-text-3" id="text-1-7">
<p>
En <i>Emacs</i> además de lo visto existen infinidad de paquetes que nos <b>ayudan a programar</b> en los
distintos lenguajes de programación. Yo creo casi no hay lenguaje que no tenga un <i>modo</i> para
<i>Emacs</i>. 
</p>

<p>
Los paquetes van desde ayudas para la <b>sintaxis, comprobadores de estilos, identadores automáticos,
generadores de código, refactorizadores</b> y un largo etcétera. 
</p>

<p>
Sería muy largo explicar todo eso aquí así que os prometo que en un futuro haré artículos viendo
esos paquetes para los lenguajes más famosos y para otros no tan famosos. 
</p>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">1.8</span> Otros paquetes que pueden ser interesantes</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Hay muchísimo paquetes para Emacs con distintas <b>funcionalidades</b>. Algunos de ellos
pueden ser:
</p>

<ol class="org-ol">
<li><b>olivetti</b>. Que nos centra el texto según un tamaño que le indiquemos.</li>
<li><b>helm</b>. Un gran paquete que veremos en un futuro pero que os recomiendo este <a href="https://daemons.cf/posts/introduccin-a-helm/">artículo</a>.</li>
<li><b>org-pomodoro</b>. Ya hablaremos de org pero con este paquete además podemos añadirle la <b>técnica pomodoro</b>.</li>
<li><b>nyan-mode</b>. Que nos muestra a este <b>famoso gato</b> en nuestra barra de abajo</li>
<li><b>nlim y minimap</b>. Para añadir los números de línea a la izquierda y un <b>minimapa</b> de nuestro fichero donde querramos.</li>
<li>y muchos más que ya veremos</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">2</span> Punto y aparte</h2>
<div class="outline-text-2" id="text-2">
<p>
Ya hemos visto gran cantidad de cosas que podemos hacer con Emacs una vez instalado. Algunas
son más importantes que otras y para algunas personas seguro que su listado de cosas que hacer
es distinto. 
</p>

<p>
Como ya he recalcado en más de una ocasión cada uno de los paquetes comentados tendrán su propio o propios
artículos ya que algunos son altamente interesantes, además veremos muchos más paquetes y ya dejaré en manos
del lector si creen que son fundamentales para ellos o no. 
</p>

<p>
Aún queda una tercera parte en la que contaremos algunas cosillas que pueden estar bien hacer pero desde un punto
de vista más bien estético.  
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Maxxcan</p>
<p class="date">Created: 2016-07-19 mar 17:03</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
